<?php
/*
 *
Кратко      OBIS HEX 	    OBIS decimal 	LK channel 	            Описание 	                                                              Единица измерения
- 	        0800010000FF 	8.0.1.0.0.255 	160 	                Холодная вода 	м³
- 	        0900010000FF 	9.0.1.0.0.255 	159 	                Горячая вода 	м³
- 	        0600010000FF 	6.0.1.0.0.255 	heat_power 	            Тепловая энергия 	кВт·ч/ГКал
- 	        0700030000FF 	7.0.3.0.0.255 	1053 	                Газ 	м³
A⁺ T1 	    0100010801FF 	1.0.1.8.1.255 	electro_ac_p_lsum_t1 	Активная энергия к потребителю по сумме фаз тариф 1 с момента сброса 	  кВт·ч
A⁺ T2 	    0100010802FF 	1.0.1.8.2.255 	electro_ac_p_lsum_t2 	Активная энергия к потребителю по сумме фаз тариф 2 с момента сброса 	  кВт·ч
A⁺ T3 	    0100010803FF 	1.0.1.8.3.255 	electro_ac_p_lsum_t3 	Активная энергия к потребителю по сумме фаз тариф 3 с момента сброса 	  кВт·ч
A⁺ T4 	    0100010804FF 	1.0.1.8.4.255 	electro_ac_p_lsum_t4 	Активная энергия к потребителю по сумме фаз тариф 4 с момента сброса 	  кВт·ч
A⁺ Σ 	    0100010800FF 	1.0.1.8.0.255 	electro_ac_p_lsum_tsum 	Активная энергия к потребителю по сумме фаз и тарифов с момента сброса 	  кВт·ч
A⁻ T1 	    0100020801FF 	1.0.2.8.1.255 	electro_ac_m_lsum_t1 	Активная энергия от потребителя по сумме фаз тариф 1 с момента сброса 	  кВт·ч
A⁻ T2 	    0100020802FF 	1.0.2.8.2.255 	electro_ac_m_lsum_t2 	Активная энергия от потребителя по сумме фаз тариф 2 с момента сброса 	  кВт·ч
A⁻ T3 	    0100020803FF 	1.0.2.8.3.255 	electro_ac_m_lsum_t3 	Активная энергия от потребителя по сумме фаз тариф 3 с момента сброса 	  кВт·ч
A⁻ T4 	    0100020804FF 	1.0.2.8.4.255 	electro_ac_m_lsum_t4 	Активная энергия от потребителя по сумме фаз тариф 4 с момента сброса 	  кВт·ч
A⁻ ΣT 	    0100020800FF 	1.0.2.8.0.255 	electro_ac_m_lsum_tsum 	Активная энергия от потребителя по сумме фаз и тарифов с момента сброса   кВт·ч
Q⁺ T1 	    0100030801FF 	1.0.3.8.1.255 	electro_re_p_lsum_t1 	Реактивная энергия к потребителю по сумме фаз тариф 1 с момента сброса 	  квар·ч
Q⁺ T2 	    0100030802FF 	1.0.3.8.2.255 	electro_re_p_lsum_t2 	Реактивная энергия к потребителю по сумме фаз тариф 2 с момента сброса 	  квар·ч
Q⁺ T3 	    0100030803FF 	1.0.3.8.3.255 	electro_re_p_lsum_t3 	Реактивная энергия к потребителю по сумме фаз тариф 3 с момента сброса 	  квар·ч
Q⁺ T4 	    0100030804FF 	1.0.3.8.4.255 	electro_re_p_lsum_t4 	Реактивная энергия к потребителю по сумме фаз тариф 4 с момента сброса 	  квар·ч
Q⁺ ΣT 	    0100030800FF 	1.0.3.8.0.255 	electro_re_p_lsum_tsum 	Реактивная энергия к потребителю по сумме фаз и тарифов с момента сброса  квар·ч
Q⁻ T1 	    0100040801FF 	1.0.4.8.1.255 	electro_re_m_lsum_t1 	Реактивная энергия от потребителя по сумме фаз тариф 1 с момента сброса   квар·ч
Q⁻ T2 	    0100040802FF 	1.0.4.8.2.255 	electro_re_m_lsum_t2 	Реактивная энергия от потребителя по сумме фаз тариф 2 с момента сброса   квар·ч
Q⁻ T3 	    0100040803FF 	1.0.4.8.3.255 	electro_re_m_lsum_t3 	Реактивная энергия от потребителя по сумме фаз тариф 3 с момента сброса   квар·ч
Q⁻ T4 	    0100040804FF 	1.0.4.8.4.255 	electro_re_m_lsum_t4 	Реактивная энергия от потребителя по сумме фаз тариф 4 с момента сброса   квар·ч
Q⁻ ΣT 	    0100040800FF 	1.0.4.8.0.255 	electro_re_m_lsum_tsum 	Реактивная энергия от потребителя по сумме фаз и тарифов с момента сброса квар·ч
S⁺ T1 	    0100090801FF 	1.0.9.8.1.255 	electro_ap_p_lsum_t1 	Полная энергия к потребителю по сумме фаз тариф 1 с момента сброса 	      кВ·А·ч
S⁺ T2 	    0100090802FF 	1.0.9.8.2.255 	electro_ap_p_lsum_t2 	Полная энергия к потребителю по сумме фаз тариф 2 с момента сброса 	      кВ·А·ч
S⁺ T3 	    0100090803FF 	1.0.9.8.3.255 	electro_ap_p_lsum_t3 	Полная энергия к потребителю по сумме фаз тариф 3 с момента сброса 	      кВ·А·ч
S⁺ T4 	    0100090804FF 	1.0.9.8.4.255 	electro_ap_p_lsum_t4 	Полная энергия к потребителю по сумме фаз тариф 4 с момента сброса 	      кВ·А·ч
S⁺ ΣT 	    0100090800FF 	1.0.9.8.0.255 	electro_ap_p_lsum_tsum 	Полная энергия к потребителю по сумме фаз и тарифов с момента сброса 	  кВ·А·ч
A⁺ L1 	    0100150700FF 	1.0.21.7.0.255 	electro_ac_p_l1 	    Активная мощность к потребителю по фазе A 	                              кВт
A⁺ L2 	    0100290700FF 	1.0.41.7.0.255 	electro_ac_p_l2 	    Активная мощность к потребителю по фазе B 	                              кВт
A⁺ L3 	    01003D0700FF 	1.0.61.7.0.255 	electro_ac_p_l3 	    Активная мощность к потребителю по фазе C 	                              кВт
A⁺ ΣL 	    0100010700FF 	1.0.1.7.0.255 	electro_ac_p_lsum 	    Активная мощность к потребителю по сумме фаз 	                          кВт
A⁻ L1 	    0100160700FF 	1.0.22.7.0.255 	electro_ac_m_l1 	    Активная мощность от потребителя по фазе A 	                              кВт
A⁻ L2 	    01002A0700FF 	1.0.42.7.0.255 	electro_ac_m_l2 	    Активная мощность от потребителя по фазе B 	                              кВт
A⁻ L3 	    01003E0700FF 	1.0.62.7.0.255 	electro_ac_m_l3 	    Активная мощность от потребителя по фазе C 	                              кВт
A⁻ ΣL 	    0100020700FF 	1.0.2.7.0.255 	electro_ac_m_lsum 	    Активная мощность от потребителя по сумме фаз 	                          кВт
Q⁺ L1 	    0100170700FF 	1.0.23.7.0.255 	electro_re_p_l1 	    Реактивная мощность к потребителю по фазе А 	                          квар
Q⁺ L2 	    01002B0700FF 	1.0.43.7.0.255 	electro_re_p_l2 	    Реактивная мощность к потребителю по фазе В 	                          квар
Q⁺ L3 	    01003F0700FF 	1.0.63.7.0.255 	electro_re_p_l3 	    Реактивная мощность к потребителю по фазе С 	                          квар
Q⁺ ΣL 	    0100030700FF 	1.0.3.7.0.255 	electro_re_p_lsum 	    Реактивная мощность к потребителю по сумме фаз 	                          квар
Q⁻ L1 	    0100180700FF 	1.0.24.7.0.255 	electro_re_m_l1 	    Реактивная мощность от потребителя по фазе А 	                          квар
Q⁻ L2 	    01002C0700FF 	1.0.44.7.0.255 	electro_re_m_l2 	    Реактивная мощность от потребителя по фазе B 	                          квар
Q⁻ L3 	    0100400700FF 	1.0.64.7.0.255 	electro_re_m_l3 	    Реактивная мощность от потребителя по фазе C 	                          квар
Q⁻ ΣL 	    0100040700FF 	1.0.4.7.0.255 	electro_re_m_lsum 	    Реактивная мощность от потребителя по сумме фаз 	                      квар
S⁺ ΣL1 	    01001D0700FF 	1.0.29.7.0.255 	electro_ac_l1 	        Полная мощность по фазе А 	                                              кВ·А
S⁺ ΣL2 	    0100310700FF 	1.0.49.7.0.255 	electro_ac_l2 	        Полная мощность по фазе В 	                                              кВ·А
S⁺ ΣL3 	    0100450700FF 	1.0.69.7.0.255 	electro_ac_l3 	        Полная мощность по фазе С 	                                              кВ·А
S⁺ ΣL 	    0100090700FF 	1.0.9.7.0.255 	electro_ac_lsum 	    Полная мощность по сумме фаз 	                                          кВ·А
I L1 	    01001F0700FF 	1.0.31.7.0.255 	electro_current_l1 	    Ток по фазе А 	                                                          А
I L2 	    0100330700FF 	1.0.51.7.0.255 	electro_current_l2 	    Ток по фазе B 	                                                          А
I L3 	    0100470700FF 	1.0.71.7.0.255 	electro_current_l3 	    Ток по фазе C 	                                                          А
I ΣL 	    01000B0700FF 	1.0.11.7.0.255 	electro_current 	    Ток по сумме фаз 	                                                      А
V L1 	    0100200700FF 	1.0.32.7.0.255 	electro_voltage_l1 	    Напряжение фазы A 	                                                      В
V L2 	    0100340700FF 	1.0.52.7.0.255 	electro_voltage_l2 	    Напряжение фазы B 	                                                      В
V L3 	    0100480700FF 	1.0.72.7.0.255 	electro_voltage_l3 	    Напряжение фазы C 	                                                      В
V ΣL 	    01000C0700FF 	1.0.12.7.0.255 	electro_voltage 	    Напряжение по сумме фаз 	                                              В
F 	        01000E0700FF 	1.0.14.7.0.255 	electro_frequency 	    Частота сети 	                                                          Гц
cos(φ) L1 	0100210700FF 	1.0.33.7.0.255 	electro_cosfi_l1 	    Коэффициент мощности фазы А 	                                          -
cos(φ) L2 	0100350700FF 	1.0.53.7.0.255 	electro_cosfi_l2 	    Коэффициент мощности фазы B 	                                          -
cos(φ) L3 	0100490700FF 	1.0.73.7.0.255 	electro_cosfi_l3 	    Коэффициент мощности фазы C 	                                          -
cos(φ) ΣL 	01000D0700FF 	1.0.13.7.0.255 	electro_cosfi_lsum 	    Общий коэффициент мощности 	                                              -
∠ A-B 	    010051070AFF 	1.0.81.7.10.255 electro_l1_l2_angle 	Угол между фазами А-B 	                                                  °
∠ B-C 	    0100510715FF 	1.0.81.7.21.255 electro_l2_l3_angle 	Угол между фазами B-С 	                                                  °
∠ A-C 	    0100510702FF 	1.0.81.7.2.255 	electro_l3_l1_angle 	Угол между фазами А-С 	                                                  °
In 	        01005B0700FF 	1.0.91.7.0.255 	electro_neutral_current Ток нейтрали 	                                                          А
Pmax 	    0100010600FF 	1.0.1.6.0.255 	electro_max_power 	    Максимальная мощность за месяц и время пика мощности 	                  кВт

 */

return [
    'obis' => [
        '0800010000FF' => '8.0.1.0.0.255',
        '0900010000FF' => '9.0.1.0.0.255',
        '0600010000FF' => '6.0.1.0.0.255',
        '0700030000FF' => '7.0.3.0.0.255',
        '0100010801FF' => '1.0.1.8.1.255',
        '0100010802FF' => '1.0.1.8.2.255',
        '0100010803FF' => '1.0.1.8.3.255',
        '0100010804FF' => '1.0.1.8.4.255',
        '0100010800FF' => '1.0.1.8.0.255',
        '0100020801FF' => '1.0.2.8.1.255',
        '0100020802FF' => '1.0.2.8.2.255',
        '0100020803FF' => '1.0.2.8.3.255',
        '0100020804FF' => '1.0.2.8.4.255',
        '0100020800FF' => '1.0.2.8.0.255',
        '0100030801FF' => '1.0.3.8.1.255',
        '0100030802FF' => '1.0.3.8.2.255',
        '0100030803FF' => '1.0.3.8.3.255',
        '0100030804FF' => '1.0.3.8.4.255',
        '0100030800FF' => '1.0.3.8.0.255',
        '0100040801FF' => '1.0.4.8.1.255',
        '0100040802FF' => '1.0.4.8.2.255',
        '0100040803FF' => '1.0.4.8.3.255',
        '0100040804FF' => '1.0.4.8.4.255',
        '0100040800FF' => '1.0.4.8.0.255',
        '0100090801FF' => '1.0.9.8.1.255',
        '0100090802FF' => '1.0.9.8.2.255',
        '0100090803FF' => '1.0.9.8.3.255',
        '0100090804FF' => '1.0.9.8.4.255',
        '0100090800FF' => '1.0.9.8.0.255',
        '0100150700FF' => '1.0.21.7.0.255',
        '0100290700FF' => '1.0.41.7.0.255',
        '01003D0700FF' => '1.0.61.7.0.255',
        '0100010700FF' => '1.0.1.7.0.255',
        '0100160700FF' => '1.0.22.7.0.255',
        '01002A0700FF' => '1.0.42.7.0.255',
        '01003E0700FF' => '1.0.62.7.0.255',
        '0100020700FF' => '1.0.2.7.0.255',
        '0100170700FF' => '1.0.23.7.0.255',
        '01002B0700FF' => '1.0.43.7.0.255',
        '01003F0700FF' => '1.0.63.7.0.255',
        '0100030700FF' => '1.0.3.7.0.255',
        '0100180700FF' => '1.0.24.7.0.255',
        '01002C0700FF' => '1.0.44.7.0.255',
        '0100400700FF' => '1.0.64.7.0.255',
        '0100040700FF' => '1.0.4.7.0.255',
        '01001D0700FF' => '1.0.29.7.0.255',
        '0100310700FF' => '1.0.49.7.0.255',
        '0100450700FF' => '1.0.69.7.0.255',
        '0100090700FF' => '1.0.9.7.0.255',
        '01001F0700FF' => '1.0.31.7.0.255',
        '0100330700FF' => '1.0.51.7.0.255',
        '0100470700FF' => '1.0.71.7.0.255',
        '01000B0700FF' => '1.0.11.7.0.255',
        '0100200700FF' => '1.0.32.7.0.255',
        '0100340700FF' => '1.0.52.7.0.255',
        '0100480700FF' => '1.0.72.7.0.255',
        '01000C0700FF' => '1.0.12.7.0.255',
        '01000E0700FF' => '1.0.14.7.0.255',
        '0100210700FF' => '1.0.33.7.0.255',
        '0100350700FF' => '1.0.53.7.0.255',
        '0100490700FF' => '1.0.73.7.0.255',
        '01000D0700FF' => '1.0.13.7.0.255',
        '010051070AFF' => '1.0.81.7.10.255',
        '0100510715FF' => '1.0.81.7.21.255',
        '0100510702FF' => '1.0.81.7.2.255',
        '01005B0700FF' => '1.0.91.7.0.255',
        '0100010600FF' => '1.0.1.6.0.255',
    ]
];
